Мюнцкабинент_30/src/Documents/РеализацияОбъектовКоллекций/РеализацияОбъектовКоллекций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияОбъектовКоллекций</name>
  <comment>Продажа монет</comment>
  <registerRecords>AccumulationRegister.ПродажаМонет</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияМонет</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьДопРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Монета</name>
      <type>
        <types>CatalogRef.Монеты</types>
      </type>
    </attributes>
    <attributes>
      <name>Коллекция</name>
      <type>
        <types>CatalogRef.Коллекции</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мюнцкабинент_30/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <comment>Дополнительные расходы: стоимость приобретения альбомов, холдеров и проч.</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/AccumulationRegisters/ДвиженияМонет/ДвиженияМонет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияМонет</name>
  <comment>Приходные и расходные операции с монетами</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <comment>Фактически себестоимость единицы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/AccumulationRegisters/ПродажаМонет/ПродажаМонет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажаМонет</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/Documents/РеализацияОбъектовКоллекций/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ДополнительныеРасходы Расход
	Если УчитыватьДопРасходы Тогда
		
		Движения.ДополнительныеРасходы.Записывать = Истина;
		Движение 					= Движения.ДополнительныеРасходы.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		Движение.Коллекционер 	= Коллекционер;
		Движение.Сумма 			= Список.Итог("ДопРасходы");
		
	КонецЕсли;	
	
	// регистр ДвиженияМонет Расход
	Движения.ДвиженияМонет.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		
		Движение 					= Движения.ДвиженияМонет.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		Движение.Объект 			= ТекСтрокаСписок.Монета;
		Движение.Коллекция			= ТекСтрокаСписок.Коллекция;
		Движение.Количество		= ?(ТекСтрокаСписок.Количество > 0, ТекСтрокаСписок.Количество, 1);
				
		ИнформацияПоМонете		= РегистрыНакопления.ДвиженияМонет.ПолучитьИнформациюПоОбъекту(ТекСтрокаСписок.Монета, Дата); 
		Если ИнформацияПоМонете.Свойство ("Стоимость") Тогда
			Движение.Стоимость		= ИнформацияПоМонете.Стоимость;
		КонецЕсли;	
		
	КонецЦикла;
	
	// по регистру Продажи монет
	Движения.ПродажаМонет.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		
		Движение 					= Движения.ПродажаМонет.Добавить();
		Движение.Период 			= Дата;
		Движение.Объект 			= ТекСтрокаСписок.Монета;
		Движение.Валюта 			= ТипЦены.Валюта;
		Движение.Коллекция			= ТекСтрокаСписок.Коллекция;
		Движение.Количество		= ?(ТекСтрокаСписок.Количество > 0, ТекСтрокаСписок.Количество, 1);
		Движение.Сумма 			= ТекСтрокаСписок.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПроверяемыеРеквизиты.Найти ("ТипЦены") = Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить ("ТипЦены")	
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Список.Итог("Сумма");
	
КонецПроцедуры
